test_new/multiphaseEuler/heatTransferLimitedPhaseChange/waterEvaporation/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (steam water);

steam
{
    type            purePhaseModel;

    diameterModel   none;

    residualAlpha   1e-6;
}

water
{
    type            purePhaseModel;

    diameterModel
    {
        type            constant;
        d               5e-4;
    }

    residualAlpha   1e-6;
}

blending
{
    default
    {
        type            continuous;
        phase           steam;
    }
}

surfaceTension
{
    steam_water
    {
        type            constant;
        sigma           0.07;
    }
}

// ************************************************************************* //
