test_new/multiphaseEuler/heatTransferLimitedPhaseChange/waterEvaporation/constant/physicalProperties.water.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          eConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight   18.0153;
    }
    equationOfState
    {
        rho         1027;
    }
    thermodynamics
    {
        hf          -1.58643e+07;
        Cv          4195;
        Cp          4195;
        Tref        372.76;
        hsRef       312508;
        esRef       312410;
    }
    transport
    {
        mu          2.8291e-4;
        Pr          2.289;
    }
}

// ************************************************************************* //
