test_new/multiphaseEuler/heatTransferLimitedPhaseChange/waterEvaporation/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeFunc continuity
#includeFunc volAverage
(
    name=plot,
    alpha.steam,
    alpha.water,
    p,
    T.steam,
    T.water,
    dMass.steam,
    dMass.water,
    dMass,
    dEnergy.steam,
    dEnergy.water,
    dEnergy
)

// ************************************************************************* //
